#- Создайте программу для игры с конфетами человек против человека.
#Условие задачи: На столе лежит 2021 конфета. 
# Играют два игрока делая ход друг после друга. Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.
#  Тот, кто берет последнюю конфету - проиграл.

#a) Добавьте игру против бота

#b) Подумайте как наделить бота ""интеллектом""
count_of_sweats = int(input('введите количество конфет на столе: '))
take_of_sweets = int(input('введите количество конфет за один ход:'))
gamer_1, gamer_2 = input('введите имя 1 игрока: '), input('введите имя 2 игрока: ')
# здесь будет код, пока не хватило сил и времени разобраться, могу прислать с другим дз?:))